return {
    ['zabivnoy'] = {
        name = "Забивной",
        desc = "сыграть в забив",
        tip = "Введите команду <<Ева, забив>> и победите кого-либо."
    },

    ['yariknegazuy'] = {
        name = "Ярик не газуй",
        desc = "купить больше 1000 яриков за раз",
        tip = "Введите команду <<Ева, банк купить 1001>>."
    },

    ['hacker'] = {
        name = "HACKERMAN",
        desc = "взломать банк"
    },

    ['dalnoboy'] = {
        name = "Ты дальнобой",
        desc = "взять перевозку"
    },

    ['jmihnulo'] = {
        name = "Ух жмыхнуло",
        desc = "жмыхнуть картинку"
    },

    ['feedppet'] = {
        name = "Сытый Питун",
        desc = "покормить питомца до 100%"
    },

    ['itsmax'] = {
        name = "Это Макс",
        desc = "использовать команду <<маньяк>>"
    },

    ['mymem'] = {
        name = "Мой мемес",
        desc = "наложить текст на фото"
    },

    ['coinflip'] = {
        name = "Конфлиппер",
        desc = "сыграть в коинфлип на сумму от 10 000 бит"
    },

    ['jmihface'] = {
        name = "ЛИЦОЖМЫХЕР",
        desc = "использовать команду `жмыхфейс`"
    },

    ['myhome'] = {
        name = "Родной дом",
        desc = "купить или поселиться в доме"
    },

    ['sport'] = {
        name = "Качок",
        desc = "апнуть 100 ед. силы"
    },

    ['slabak'] = {
        name = "Слабак",
        desc = "апнуть 100 000 ед. силы"
    },

    ['sishik'] = {
        name = "Мамин сыщик",
        desc = "использовать команду `искать`"
    },

    ['iknow'] = {
        name = "Я знаю",
        desc = "подписаться на рассылку"
    },

    ['achman'] = {
        name = "АчивМен",
        desc = "создать свою ачивку"
    },

    ['zoj'] = {
        name = "ЗОЖ",
        desc = "выпить коктейль в Б2С"
    },

    ['halava'] = {
        name = "Халявщик",
        desc = "получить деньги с раздачи"
    },

    ['77lol'] = {
        name = "Почти портвейн",
        desc = "получить две семёрки в `слот`"
    },

    ['777'] = {
        name = "Портвейн",
        desc = "получить три семёрки в `слот`"
    },

    ['maxlot'] = {
        name = "Награда за риск",
        desc = "победить 1КК в лотерее"
    },

    ['skidka'] = {
        name = "Скидки",
        desc = "выбить скидку от 15 рублей в `искать`"
    },

    ['sovpalo'] = {
        name = "Совпало",
        desc = "угадать время обвала в краше"
    },

    ['invest'] = {
        name = "Инвициций",
        desc = "выиграть в инвесте"
    },

    ['caseman'] = {
        name = "Жъжъь",
        desc = "открыть кейс"
    },

    ['rate'] = {
        name = "А ведь решает",
        desc = "поставить оценку в сервисе `боты`"
    },
}
