local cities = {
    { id = 1, name = "Варифан", x = 524, y = 136 },
    { id = 2, name = "Нирьяна", x = 436, y = 525 },
    { id = 3, name = "Масимы", x = 314, y = 796 },
    { id = 4, name = "Таксисты", x = 39, y = 807 },
    { id = 5, name = "Сайт-Евыбург", x = 920, y = 176 },
    { id = 6, name = "Ула-Ула", x = 121, y = 377 },
    { id = 7, name = "Югобайкальск", x = 24, y = 888 },
    { id = 8, name = "Папки", x = 367, y = 172 },
    { id = 9, name = "Мамки", x = 758, y = 273 },
    { id = 10, name = "Ба-Ба", x = 90, y = 634 },
    { id = 11, name = "Мультимор", x = 900, y = 596 },
    { id = 12, name = "Дарьекио", x = 228, y = 300 }
}

local streets = {
    { "Трубачеева", "Мелова", "Анабякина", "Бурско", "Челбрино", "Бутылка", "Коммондора", "Цифровых", "Кайзер", "Шопен" },
    { "Зайцевых", "Часовая", "Детей", "Абругэ", "Петровича", "Тьиголр", "Космическая" },
    { "Мажоров", "Килька", "Анастасийская", "Сяомитопова", "Боня", "Волков", "Медведьева" },
    { "Тупала", "Электроники", "Удав", "Вязов", "Денди", "Клавишна", "Победы" },
    { "Октябрьская", "Гламурных", "Слёз", "Веселья", "Нинтендо", "Арьяна", "Госпожи" },
    { "Валентины", "Депрессии", "Кучеркода", "Машин", "Авиационная", "Мамок", "Сяомитопова" },
    { "Чачлыка", "Милы", "Копа", "Авторских прав", "Бассов", "Атом", "Фуайфон" },
    { "Создатель", "Дезоксирибонуклеиновая", "Синхфазотрон", "Ацетилсалициловая", "Ага", "Х", "Любимые" },
    { "Яустал", "Николаева", "Рвоапщкл", "Мяу", "Буюн", "Лисят", "Рычащих" },
    { "Улиц", "Прошедшего времени", "Жизни", "Карга", "Цыбина", "Жаба", "Технарей" },
    { "Насос Алый", "Ситис", "Щапова", "Луа", "Михаила", "Снежная", "Романтизма" },
    { "Классическая", "Гребеня", "Шестедевять", "Максоса", "Последняя", "Лжецов", "Первая" },
    { "Картавых", "Шайтан", "Грэс", "Шибора", "Ширак", "Хоккейная", "Териаки" }
}

local structure_names = {
    "free", "box", "hut", "peasant", "house", "cottage", "penthouse"
}

local structures = {
    -- ["name"] = { minprice, maxprice, variants }
    ["free"] = { "Участок", 0, 0, 5 },
    ["box"] = { "Коробка", 100, 1000, 5 },
    ["hut"] = { "Шалаш", 1000, 10000, 5 },
    ["peasant"] = { "Халупа", 10000, 1500000, 5 },
    ["house"] = { "Дом", 1000000, 3000000, 5 },
    ["cottage"] = { "Коттедж", 2500000, 50000000, 5 },
    ["penthouse"] = { "Пентхаус", 10000000, 100000000, 5 }
}

return cities, streets, structure_names, structures
