local command = botcmd.new("б2с", "известный магазин еды", {dev=1})

command.products = {
    { "🍏", "Яблоко", { 40, 60 }, { 5, 10 } },
    { "🍐", "Груша", { 30, 60 }, { 2, 5 } },
    { "🍊", "Мандарин", { 30, 60 }, { 3, 8 } },
    { "🍋", "Лимон", { 30, 60 }, { 3, 8 } },
    { "🍌", "Банан", { 30, 60 }, { 3, 8 } },
    { "🍉", "Арбуз", { 30, 60 }, { 3, 8 } },
    { "🍇", "Виноград", { 30, 60 }, { 3, 8 } },
    { "🍓", "Клубника", { 30, 60 }, { 3, 8 } },
    { "🍈", "Дыня", { 30, 60 }, { 3, 8 } },
    { "🍒", "Вишня", { 30, 60 }, { 3, 8 } },
    { "🍑", "Персик", { 30, 60 }, { 3, 8 } },
    { "🍍", "Ананас", { 30, 60 }, { 3, 8 } },
    { "🍅", "Помидор", { 30, 60 }, { 3, 8 } },
    { "🍆", "Баклажан", { 30, 60 }, { 3, 8 } },
    { "🌶", "Острый перец", { 30, 60 }, { 3, 8 } },
    { "🌽", "Кукуруза", { 30, 60 }, { 3, 8 } },
    { "🍠", "Жаренная картошка", { 30, 60 }, { 3, 8 } },
    { "🍯", "Мёд", { 30, 60 }, { 3, 8 } },
    { "🍞", "Хлеб", { 30, 60 }, { 3, 8 } },
    { "🧀", "Сыр", { 30, 60 }, { 3, 8 } },
    { "🍗", "Куринная ножка", { 30, 60 }, { 3, 8 } },
    { "🍖", "Мясо на косточке", { 30, 60 }, { 3, 8 } },
    { "🍤", "Жаренная креветка", { 30, 60 }, { 3, 8 } },
    { "🍳", "Яичница", { 30, 60 }, { 3, 8 } },
    { "🍔", "Гамбургер", { 30, 60 }, { 3, 8 } },
    { "🍟", "Картошка фри", { 30, 60 }, { 3, 8 } },
    { "🌭", "Хот-Дог", { 30, 60 }, { 3, 8 } },
    { "🍕", "Пицца", { 30, 60 }, { 3, 8 } },
    { "🍝", "Спагетти", { 30, 60 }, { 3, 8 } },
    { "🌮", "Тако", { 30, 60 }, { 3, 8 } },
    { "🌯", "Буритто", { 30, 60 }, { 3, 8 } },
    { "🍜", "Лапша", { 30, 60 }, { 3, 8 } },
    { "🍲", "Суп", { 30, 60 }, { 3, 8 } },
    { "🍥", "Рыбная котлета", { 30, 60 }, { 3, 8 } },
    { "🍣", "Суши", { 30, 60 }, { 3, 8 } },
    { "🍛", "Рис", { 30, 60 }, { 3, 8 } },
    { "🍧", "Мороженное", { 80, 160 }, { 3, 18 } },
    { "🍦", "Мороженное в стаканчике", { 30, 120 }, { 3, 8 } },
    { "🍰", "Торт", { 30, 60 }, { 3, 8 } },
    { "🍮", "Пудинг", { 30, 60 }, { 3, 8 } },
    { "🍬", "Конфетка", { 30, 60 }, { 3, 8 } },
    { "🍭", "Леденец", { 30, 60 }, { 3, 8 } },
    { "🍫", "Шоколад", { 30, 60 }, { 3, 8 } },
    { "🍿", "Попкорн", { 30, 60 }, { 3, 8 } },
    { "🍩", "Пончик", { 30, 60 }, { 3, 8 } },
    { "🍪", "Печенье", { 30, 60 }, { 3, 8 } },
    { "🍺", "Квас", { 30, 60 }, { 3, 8 } },
    { "🍸", "Коктейль", { 30, 60 }, { 3, 8 } },
    { "☕", "Чай", { 30, 60 }, { 3, 8 } },
    { "☕", "Коффе", { 30, 60 }, { 3, 8 } },
    { "🥐", "Круассан", { 30, 60 }, { 3, 8 } },
    { "🥑", "Авокадо", { 30, 60 }, { 3, 8 } },
    { "🥒", "Огурец", { 30, 60 }, { 3, 8 } },
    { "🥓", "Бекон", { 30, 60 }, { 3, 8 } },
    { "🥔", "Картошка", { 30, 60 }, { 3, 8 } },
    { "🥕", "Морковь", { 30, 60 }, { 3, 8 } },
    { "🥗", "Салат", { 30, 60 }, { 3, 8 } },
    { "🥙", "Фалафель", { 120, 130 }, { 10, 15 } },
    { "🥚", "Яйцо", { 7, 10 }, { 2, 5 } },
    { "🥛", "Молоко", { 30, 60 }, { 3, 8 } },
    { "🥜", "Арахис", { 30, 60 }, { 3, 8 } },
    { "🥝", "Киви", { 30, 60 }, { 3, 8 } },
    { "🥞", "Блины", { 30, 60 }, { 3, 8 } }
}

function command.exe(msg, args, other, rmsg, user)
    local menu = { }
    for i = 1,5 do
        local food = trand(command.products)
        table.insert(menu, {
            smile = food[1],
            name = food[2],
            price = math.random(table.unpack(food[3])),
            score = food[4]
        })
    end

    rmsg:lines (
        "🥙 Меню заведения <<Б2С>>",
        { menu, "➤ :i:. :smile: :name: >> :price: бит." },
        "🔢 Используйте цифры для выбора варианта меню"
    )

    oneb(rmsg, math.random(5))

    numcmd.linst(user, function(msg, num, other, rmsg, user)
        command.eat(msg, ca(menu[num], "такая еда у нас не продаётся", math.random(5)), other, rmsg, user)
    end)
end

function command.eat(msg, food, other, rmsg, user)
    user:buy(food.price)
    local score = math.random(food.score[1], food.score[2])
    user:addScore(score)
    rmsg:line("%s Вы успешно съели %s и получили %i ед. опыта.", food.smile, food.name:lower(), score)
    oneb(rmsg, "б2с")

    user:unlockAchivCondition('zoj', food.name == "Коктейль")
end

return command
